<template>
  <div class="blog">
    <div class="blog-content">
      <h2>个人博客</h2>
      自出生时起我们便不断的在岁月里描绘人生，完美的一幅画只是一种期望游走于梦镜，给我们鼓励，给我们勇气去努力争取人世间美好。面对未知的空白，一筹莫展如炊烟袅袅笼罩在心里，人生的绘笔有点找不到落笔点，往往回首时才发现已经落错了点，已经不能涂改。 来时带一本空白画册，时光握住手在画册上描绘各自不同的人生。没有谁来时既是天资的绘画师，也没有一幅属于自己现成的画给予临摹。行走于生活的轨迹上，慢慢的学会了看风景，学会了模仿别人留下的一景一物，学会了想象属于自己的那一道风景。到了自己真正要落笔时，才发现重重困难埋伏于脚下，才发现茫茫雾雨迷离了视线，手持绘笔的手把该画的线画斜了或画短画长了。一次一次的缺憾烙印于心鞭策于己，追求完美是要渡过一段缺失的行程，冰冻三尺非一日之寒，一落笔怎能成就完美。那些错误不负期望的苦心，总在静下心自省时，降临于心田痴痴不倦的教导，在心间亮起了一盏启明灯，在往前行时免于陷入更深的错误。 在为自己的画辗转反侧，或在疑惑中剪不断理还乱时，是亲友的暖言暖语如一场春雨在耳际滋润，让那心中等待的绿意破土而出，让那飘忽不定的心在他们经历过的港湾找到安息。一路上同行相伴，相互鼓励勇敢前行，相互借鉴挡住风风雨雨。在路上可怕的不是凄迷的眼前，而是在凄迷中不愿打开看向外面世界的窗口。在书海中大师级别的一言一行就是最明亮的指路光。打开一扇门让腹有诗书气质华的暗香住进心房，再迷茫的路只要有书的亮光照进来就是充满希望。破茧成蝶需要经历一段痛苦过程，最难的不是梦想有多高远，而是脱变的过程，只要达到了千磨万击还坚韧，那么就任尔东西南北风吧。 过去的不管是遗憾还是美好都已变成了藏在记忆里的一幅画。不必揣着那些缺失黯然泪下，完整的人生本来就由完美与不完美组成，如果要细数它们的分量，那么完美只不过是终线，而不完美却是蜿蜒曲折的延绵过程。如果在听一首歌或一遍文章落泪了，那么故事中的人景必定有自己的影子，泪流的不是结局而是路上不屈不挠的前行，包括留下那些不完美。因为时光没有倒退，人生没有练习，难免不会有遗憾，或喜或悲都是独一无二的。当熟悉的声音在耳际荡漾，任自己的思绪放逐在过去的时光里遨游，让自己再一次重温旧梦感慨万千。 时光牵着手在走在走，目睹了雪山融化绿草出，看过了波光粼粼潮涨潮落，听过了细声绵绵花语鸟歌，踏过了波澜起伏似锦年华。笔下的画景越来越清新，从不熟练的画手变得愈来愈炉火纯青，一幅完整的画是有缺憾也有完美，在夕阳倚山时，对自己的画微笑、感恩
    </div>
    <div class="blog-foot">
      邮箱：254976132@qq.com | 粤ICP备17099996号-1
    </div>
  </div>
</template>

<script>
export default {
  name: 'Blog',
  created() {
    
  },
  data() {
    return {
      printing: false,
      listLoading: false,
      list: []
    }
  },
  methods: {

  }
}
</script>
<style lang="scss" scoped>
  .blog {
    background: url("~@/assets/background2.f1bd8efc.png") no-repeat;
    background-size: cover;
    min-height: 100vh;
  }
  .blog-content h2 {
    text-align: center;
  }
  .blog-content {
    padding: 10px;
    font-size: 18px;
  }
  .blog-foot {
    position: absolute;
    bottom: 5px;
    left: 50%;
    transform: translateX(-50%);
  }
</style>
